package hwk_03;

/**
 * @author waldemar Ilz
 * {@code date} 19.09.2024
 */

/*
Task 4. Теоретический
Какие числа могут получаться в качестве остатка от деления какого-либо целого числа на 2? На 3?
 */

public class Task_4 {
    public static void main(String[] args) {

    }

    /*
   При делении целого числа на 2 возможны два остатка: 0 и 1. Это связано с тем, что любое
   целое число либо четное (делится на 2 без остатка), либо нечетное (дает остаток 1 при
    делении на 2).

При делении целого числа на 3 возможны три остатка: 0, 1 и 2. Это происходит потому,
 что любое целое число может быть представлено в виде 3k, 3k + 1 или 3k + 2, где k — целое число.

Таким образом:

Остатки от деления на 2: 0, 1.
Остатки от деления на 3: 0, 1, 2.
     */


}
