package hwk_13;


/**
 * Author Waldemar Ilz
 *{code data} 24.10.2024
 */

public class Tsk_01 {

    /*

Task 1
Создать локальный репозиторий git, который будет отслеживать состоянии
 вашего проекта (там где вы пишете код уроков и домашние задания)
Создать удаленный репозиторий на GitHub
Синхронизировать локальный и удаленный репозиторий
Прислать мне ссылку на репозиторий с проектом

P.S. Если по какой-то причине вы пишете домашние работы и код на лекциях
 в двух разных проектах - создать два репозитория и прислать 2 ссылки

     */

}
